<?php

namespace App\Models;

use Illuminate\Database\Eloquent\Factories\HasFactory;
use Illuminate\Database\Eloquent\Model;

class News extends Model
{
    use HasFactory;
    public static function News(){
        return [
            0=> [
                'id' => 1,
                'headline' => 'হিরো আলমের মুচলেকায় যা আছে',
                'reporter' => 'রোজিনা ইসলাম',
                'published' => 'প্রকাশ: ০৯ আগস্ট ২০২২, ১৩: ১৮',
                'image' => 'assets/images/News1.jpg',
                'description' => 'আশরাফুল আলম সাঈদ ওরফে হিরো আলমকে ঢাকা মহানগর গোয়েন্দা পুলিশ কার্যালয়ে ডেকে মুচলেকা নেওয়ার ঘটনায় দেশে সামাজিক যোগাযোগমাধ্যমসহ বিভিন্ন মহলে আলোচনা চলছে। ',
                'time' => '১ ঘণ্টা আগে'
            ],
            1=> [
                'id' => 2,
                'headline' => 'লেবার পার্টির চেয়ারম্যানের বিরুদ্ধে ছাত্রলীগ নেতার জিডি',
                'reporter' => 'প্রতিবেদক, ঢাকা বিশ্ববিদ্যালয়',
                'published' => 'প্রকাশ: ০৯ আগস্ট ২০২২, ১৪: ০৯',
                'image' => 'assets/images/Capture1.JPG',
                'description' => 'লেবার পার্টির চেয়ারম্যান মোস্তাফিজুর রহমান ইরানের বিরুদ্ধে থানায় অভিযোগ দায়ের করেছেন ছাত্রলীগের এক কেন্দ্রীয় নেতা। ',
                'time' => '২২ মিনিট আগে'
            ],
            2=> [
                'id' => 3,
                'headline' => 'তুরাগে বিস্ফোরণে দগ্ধ ৮ জনের ৬ জনই মারা গেলেন',
                'reporter' => 'নিজস্ব প্রতিবেদক, ঢাকা',
                'published' => 'প্রকাশ: ০৯ আগস্ট ২০২২, ১৩: ০২',
                'image' => 'assets/images/Capture2.jpg',
                'description' => 'রাজধানীর তুরাগের কামারপাড়ায় ভাঙারির দোকানে বিস্ফোরণের ঘটনায় দগ্ধ আরও একজনের মৃত্যু হয়েছে। তাঁর নাম আল আমিন (৩০)। এ নিয়ে বিস্ফোরণের ঘটনায় দগ্ধ আটজনের মধ্যে ছয়জনের মৃত্যু হলো।',
                'time' => '২ ঘণ্টা আগে'
            ],
            3=> [
                'id' => 4,
                'headline' => 'ট্রেনের ভাড়া বাড়ানোর সিদ্ধান্ত এখনো হয়নি: রেলমন্ত্রী',
                'reporter' => 'প্রতিনিধি গাজীপুর',
                'published' => 'প্রকাশ: ০৯ আগস্ট ২০২২, ১৬: ৫৩',
                'image' => 'assets/images/Capture2.JPG',
                'description' => 'জ্বালানি তেলের দাম বাড়লেও ট্রেনের ভাড়া বাড়ানোর সিদ্ধান্ত নেওয়া হয়নি বলে জানিয়েছেন রেলমন্ত্রী নূরুল ইসলাম সুজন।',
                'time' => '১৯ মিনিট আগে'
            ],
            4=> [
                'id' => 5,
                'headline' => 'আমাদের অস্তিত্ব বিলুপ্তের চেষ্টার কী বাকি রেখেছেন, সরকারকে প্রশ্ন সন্তু লারমার',
                'reporter' => 'নিজস্ব প্রতিবেদক, ঢাকা',
                'published' => 'প্রকাশ: ০৯ আগস্ট ২০২২, ১৬: ৪৮',
                'image' => 'assets/images/Capture2.jpg',
                'description' => 'বাংলাদেশ আদিবাসী ফোরামের সভাপতি জ্যোতিরিন্দ্র বোধিপ্রিয় সন্তু লারমা বলেছেন, বাংলাদেশের স্বাধীনতার পর থেকে যারা ক্ষমতায় এসেছে, তারা কেউ ক্ষুদ্র জাতিসত্তার মানুষের স্বার্থ দেখেনি। ',
                'time' => '১১ মিনিট আগে'
            ],
            5=> [
                'id' => 6,
                'headline' => 'হিরো আলমের মুচলেকায় যা আছে',
                'reporter' => 'রোজিনা ইসলাম',
                'published' => 'প্রকাশ: ০৯ আগস্ট ২০২২, ১৩: ১৮',
                'image' => 'assets/images/News1.jpg',
                'description' => 'আশরাফুল আলম সাঈদ ওরফে হিরো আলমকে ঢাকা মহানগর গোয়েন্দা পুলিশ কার্যালয়ে ডেকে মুচলেকা নেওয়ার ঘটনায় দেশে সামাজিক যোগাযোগমাধ্যমসহ বিভিন্ন মহলে আলোচনা চলছে। ',
                'time' => '১ ঘণ্টা আগে'
            ],
            6=> [
                'id' => 7,
                'headline' => 'লেবার পার্টির চেয়ারম্যানের বিরুদ্ধে ছাত্রলীগ নেতার জিডি',
                'reporter' => 'প্রতিবেদক, ঢাকা বিশ্ববিদ্যালয়',
                'published' => 'প্রকাশ: ০৯ আগস্ট ২০২২, ১৪: ০৯',
                'image' => 'assets/images/Capture2.jpg',
                'description' => 'লেবার পার্টির চেয়ারম্যান মোস্তাফিজুর রহমান ইরানের বিরুদ্ধে থানায় অভিযোগ দায়ের করেছেন ছাত্রলীগের এক কেন্দ্রীয় নেতা। ',
                'time' => '২২ মিনিট আগে'
            ],
            7=> [
                'id' => 8,
                'headline' => 'তুরাগে বিস্ফোরণে দগ্ধ ৮ জনের ৬ জনই মারা গেলেন',
                'reporter' => 'নিজস্ব প্রতিবেদক, ঢাকা',
                'published' => 'প্রকাশ: ০৯ আগস্ট ২০২২, ১৩: ০২',
                'image' => 'assets/images/Capture2.jpg',
                'description' => 'রাজধানীর তুরাগের কামারপাড়ায় ভাঙারির দোকানে বিস্ফোরণের ঘটনায় দগ্ধ আরও একজনের মৃত্যু হয়েছে। তাঁর নাম আল আমিন (৩০)। এ নিয়ে বিস্ফোরণের ঘটনায় দগ্ধ আটজনের মধ্যে ছয়জনের মৃত্যু হলো।',
                'time' => '২ ঘণ্টা আগে'
            ],
            8=> [
                'id' => 9,
                'headline' => 'ট্রেনের ভাড়া বাড়ানোর সিদ্ধান্ত এখনো হয়নি: রেলমন্ত্রী',
                'reporter' => 'প্রতিনিধি গাজীপুর',
                'published' => 'প্রকাশ: ০৯ আগস্ট ২০২২, ১৬: ৫৩',
                'image' => 'assets/images/Capture1.jpg',
                'description' => 'জ্বালানি তেলের দাম বাড়লেও ট্রেনের ভাড়া বাড়ানোর সিদ্ধান্ত নেওয়া হয়নি বলে জানিয়েছেন রেলমন্ত্রী নূরুল ইসলাম সুজন।',
                'time' => '১৯ মিনিট আগে'
            ],
            9=> [
                'id' => 10,
                'headline' => 'আমাদের অস্তিত্ব বিলুপ্তের চেষ্টার কী বাকি রেখেছেন, সরকারকে প্রশ্ন সন্তু লারমার',
                'reporter' => 'নিজস্ব প্রতিবেদক, ঢাকা',
                'published' => 'প্রকাশ: ০৯ আগস্ট ২০২২, ১৬: ৪৮',
                'image' => 'assets/images/Capture2.jpg',
                'description' => 'বাংলাদেশ আদিবাসী ফোরামের সভাপতি জ্যোতিরিন্দ্র বোধিপ্রিয় সন্তু লারমা বলেছেন, বাংলাদেশের স্বাধীনতার পর থেকে যারা ক্ষমতায় এসেছে, তারা কেউ ক্ষুদ্র জাতিসত্তার মানুষের স্বার্থ দেখেনি। ',
                'time' => '১১ মিনিট আগে'
            ]

        ];
    }
}
